<?php

namespace App\Services;

class QuizExamples
{

    public function example1(int $seconds_offset = 15): array
    {
        return [
            'start_at' => date('Y-m-d H:i:s', time() + $seconds_offset),
            'duration' => 100,
            'questions' => [
                [
                    'content' => 'في أي عام فُرِض الصيام على المسلمين',
                    'is_correct' => '1',
                    'choices' => [
                        1 => 'في السنة الثانية من الهجرة',
                        2 => 'في السنة الأولى من الهجرة',
                        3 => 'في السنة الثالثة من الهجرة',
                        // 4=> 'في السنة الرابعة من الهجرة',
                    ],
                ],
                [
                    'content' => 'من هو أول من قام بالطواف حول البيت العتيق؟',
                    'is_correct' => '3',
                    'choices' => [
                        1 => 'ابراهيم عليه السلام',
                        2 => 'اسماعيل عليه السلام',
                        3 => 'الملائكة',
                        4 => 'اليهود',
                    ],
                ],
                [
                    'content' => 'ما اسم أول دار تم بناؤها في مكة المكرمة؟',
                    'is_correct' => '1',
                    'choices' => [
                        1 => 'دار الندوة',
                        2 => 'الكعبة',
                        3 => 'دار النبي',
                        // 4=> 'دار الصلاة',
                    ],
                ],
                [
                    'content' => 'من الذي جمع الناس لصلاة التراويح ؟',
                    'is_correct' => '1',
                    'choices' => [
                        1 => 'عمر بن الخطاب',
                        2 => 'الرسول صلى الله عليه و سلم',
                        3 => 'حمزة بن عبد المطلب',
                        // 4=> 'بلال ابن رباح',
                    ]
                ],

            ]
        ];
    }
}
